In [96]:
import pandas as pd

In [97]:
#1.Create a data frame with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3.

In [98]:
marks={'Roll Number':[1,2,3,4,5,6,7,8,9,10],'Name':['Abhigyan','Jash','Uday','Susanth','Lakshay','Aditi','Rahul','Ankita','Priya','Ananya'],'Gender':['Male','Male','Male','Male','Male','Female','Male','Female','Female','Female'],'Marks1':[89,77,92,67,90,46,71,34,82,78],'Marks2':[74,88,95,58,33,39,96,80,66,78],'Marks3':[90,88,67,78,35,98,76,83,90,86]}

In [99]:
df=pd.DataFrame(marks)
df

   Roll Number      Name  Gender  Marks1  Marks2  Marks3
0            1  Abhigyan    Male      89      74      90
1            2      Jash    Male      77      88      88
2            3      Uday    Male      92      95      67
3            4   Susanth    Male      67      58      78
4            5   Lakshay    Male      90      33      35
5            6     Aditi  Female      46      39      98
6            7     Rahul    Male      71      96      76
7            8    Ankita  Female      34      80      83
8            9     Priya  Female      82      66      90
9           10    Ananya  Female      78      78      86

In [100]:
#2.Create a new column with total marks

In [101]:
df['Total Marks']=df['Marks1']+df['Marks2']+df['Marks3']

In [102]:
df

   Roll Number      Name  Gender  Marks1  Marks2  Marks3  Total Marks
0            1  Abhigyan    Male      89      74      90          253
1            2      Jash    Male      77      88      88          253
2            3      Uday    Male      92      95      67          254
3            4   Susanth    Male      67      58      78          203
4            5   Lakshay    Male      90      33      35          158
5            6     Aditi  Female      46      39      98          183
6            7     Rahul    Male      71      96      76          243
7            8    Ankita  Female      34      80      83          197
8            9     Priya  Female      82      66      90          238
9           10    Ananya  Female      78      78      86          242

In [103]:
#3.Find the lowest marks in Marks1

In [104]:
print("The lowest marks in Marks1 is ",df['Marks1'].min())

The lowest marks in Marks1 is  34

In [105]:
#4.Find the Highest marks in Marks2

In [106]:
print("The highest marks in Marks2 is ",df['Marks2'].max())

The highest marks in Marks2 is  96

In [107]:
#5.Find the average marks in Marks3

In [108]:
print("The average marks in Marks3 is ",df['Marks3'].mean())

The average marks in Marks3 is  79.1

In [109]:
#6.Find student name with highest average

In [110]:
print("The student with highest average is\n",df[(df['Total Marks']/3)==(df['Total Marks']/3).max()]['Name'])

The student with highest average is
 2    Uday
Name: Name, dtype: object

In [93]:
#7.Find how many students failed in Marks2 (<40)

In [94]:
df[df.Marks2<40]

   Roll Number     Name  Gender  Marks1  Marks2  Marks3  Total Marks
4            5  Lakshay    Male      90      33      35          158
5            6    Aditi  Female      46      39      98          183

In [95]:
print("Number of students that failed in Marks2 is ",df[df.Marks2<40].shape[0])

Number of students that failed in Marks2 is  2